log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** Template Haskell
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-05-23-template-haskell
   :EXPORT_DATE: <2017-05-23>
   :ID:       3A4A2DDD-D392-4D29-A313-95558E2AD21E
   :END:

After using Haskell for a while, running into [[http://hackage.haskell.org/package/template-haskell][/Template Haskell/]]
become more and more likely. A [[http://packdeps.haskellers.com/reverse/template-haskell][reverse dependency lookup for
template-haskell]] lists over one thousand packages.

While I believe many have /used/ Template Haskell via [[http://hackage.haskell.org/package/aeson][aeson]],
[[http://hackage.haskell.org/package/language-c-inline][language-c-inline]], [[http://hackage.haskell.org/package/lens][lens]], [[http://hackage.haskell.org/package/wreq][wreq]], [[http://hackage.haskell.org/package/yesod][yesod]], or any of the other packages, my
gut feeling is that fewer have actually /written/ Template Haskell code.

/This post is not intended to advocate the use of Template Haskell,
but rather to foster a better understanding for what it is, and how it
can be used./

Template Haskell [[https://wiki.haskell.org/Template_Haskell][is described]] as a facility that adds */compile-time/*
/metaprogramming/ to Haskell. Metaprogramming is the ability of a
language to treat code as data, and write code to produce other code
to be used in the program.  Other languages have (limited)
metaprogramming facilities as well: e.g., C has macros via the C
preprocessor, that allow to expand code at compile time as well, C++
has preprocessor macros and templates, and the languages of the Lisp
family usually have macro systems and are known for their
/homoiconicity/ and metaprogramming capabilities.

*** The C preprocessor
    :PROPERTIES:
    :ID:       74A2C1AF-51D3-4A86-A98B-7F8035982ECF
    :END:

To use metaprogramming facilities we need a way to say /how/ we want to
generate code, and a way to specify /where/ to generate code. The C
preprocessor does this on a textual basis with a separate language. We
can =define= a macro:

#+BEGIN_EXAMPLE
  #define ADD_ONE(x) ((x)+1)
#+END_EXAMPLE

this will simply replace all occurrences of =ADD_ONE(x)= with =(x)+1=
prior to handing off the code to the compiler. For example:

#+BEGIN_EXAMPLE
  int x = ADD_ONE(1);
#+END_EXAMPLE

becomes

#+BEGIN_EXAMPLE
  int x = (1)+1;
#+END_EXAMPLE

*** Template Haskell Quotes
    :PROPERTIES:
    :ID:       FB7B194F-75C2-4046-86F2-36A0BF65D56C
    :END:

Contrary to the C preprocessor, Template Haskell operates on the
abstract syntax tree (AST) level. Again we need a way to describe what
we want the compiler to generate, and a directive to describe where to
generate it. GHC expects a function that generates code to live in the
Q monad. The Q monad governs its capabilities. Thus our =add_one=
function needs to be of the form:

#+BEGIN_EXAMPLE
  add_one :: Int -> Q a
#+END_EXAMPLE

We are free to generate different kinds of Haskell syntax, e.g.,
Types, Declarations, Patterns, Expression, ...; here we clearly want
an Expression:

#+BEGIN_EXAMPLE
  add_one :: Int -> Q Exp
#+END_EXAMPLE

The first interesting question is, how to build this =Exp= Expression
type. The [[http://hackage.haskell.org/package/template-haskell-2.11.1.0/docs/Language-Haskell-TH.html#t:Exp][template-haskell Haddocks for expressions]] are a good
start. We end up with:

#+BEGIN_EXAMPLE
  add_one :: Int -> Q Exp
  add_one x = pure $ InfixE (Just (LitE (IntegerL x)))
                            (VarE '(+))
                            (Just (LitE (IntegerL 1)))
#+END_EXAMPLE

We translate =x :: Int= into a /literal expression/ with an /integer
literal/ of =x=, =+= into a /variable expression/, and then combine those
using the =InfixE= constructor for /infix expression/.

There *has to be* an /easier/ way, otherwise no one would bother writing
Template Haskell in the first place. And of course there is. Template
Haskell comes with /quotation/ support. The idea is to /quote/ some
expression (or type, declaration, pattern, ...) and obtain the above
expression as simple as:

#+BEGIN_EXAMPLE
  add_one :: Int -> Q Exp
  add_one x = [| x + 1 |]
#+END_EXAMPLE

There are also quoter for declarations, type, patterns, ... or you can
even [[http://downloads.haskell.org/~ghc/latest/docs/html/users_guide/glasgow_exts.html#template-haskell-quasi-quotation][define your own quoters using]] =-XQuasiQuotes=.

/See also:/ [[https://downloads.haskell.org/~ghc/latest/docs/html/users_guide/glasgow_exts.html#template-haskell][/The GHC User Guide on Template Haskell/]]

*** Template Haskell Splices
    :PROPERTIES:
    :ID:       FB507F45-9292-46E9-A1C6-28BE26FD870B
    :END:

So far we learned how to create a function that can generate a
Q-action.  Ultimately we want to convert the generated expressions to
actual code in our program. GHC calls this splicing. We splice the
result of calling the function (e.g. =add_one=) into our program. A
/splice/ is written as =$x= or =$(...)=, where =x= is an identifier or =...=
is an arbitrary expression. Thus if our =add_one= function lives in our
=Lib= module, we can build the following =Consumer= module, which makes
use of =add_one=, as follows:

#+BEGIN_EXAMPLE
  {-# LANGUAGE TemplateHaskell #-}
  module Consumer where

  import Lib (add_one)

  two :: Int
  two = $(add_one 1)
#+END_EXAMPLE

GHC will /at compile time/ evaluate the /splice/ =$(add_one 1)=, and put the
result of evaluating =add_one 1= in the Q monad into its place.

*** The Stage Restriction
    :PROPERTIES:
    :ID:       D93350B7-B9CF-463D-9C4C-7AA093C810DF
    :END:

You might be curious as to why we (had to) placed =add_one= into its own
=Lib= module. This is often referred to as the /stage restriction/. The
functions we want to call in our splices need to be defined outside of
the module where they are used. This is necessary since they need to
be compiled first. GHC compiles the module which contains the
functions we want to use in our splice first to machine code, and when
evaluating the splice, builds a tiny bit of interpreted bytecode that
wraps the arguments and calls the function.

*** The Q Monad
    :PROPERTIES:
    :ID:       0FCA01DF-7037-4A0E-835A-13BAFDBC2D5C
    :END:

I've mentioned the Q monad earlier and said it governs the
metaprogramming capabilities of the functions we call in our splices.
The =Quasi= [[http://hackage.haskell.org/package/template-haskell/docs/Language-Haskell-TH-Syntax.html#t:Quasi][type class]] describes the interface that we can make use of
when constructing Template Haskell functions.

Of special note should be the =qRunIO :: IO a -> m a=. Which is wrapped
by =runIO :: IO a -> Q a=. This function allows to execute /arbitrary/ IO
actions *at compile time!* This allows capabilities like reading
(e.g. [[https://hackage.haskell.org/package/file-embed][file-embed]]) and writing arbitrary files or running
commands/processes (e.g.  [[https://hackage.haskell.org/package/gitrev][gitrev]]). While this power can provide great
utility, I believe we should be well aware of this fact when compiling
arbitrary third party code.

